# Module 5: Security ğŸ”

> **20% of ENCOR Exam | Estimated Time: 40-50 hours**

## Module Overview

Advanced security covering control plane protection, identity services, and encryption technologies beyond CCNA level.

---

## Table of Contents

1. [Infrastructure Security](#1-infrastructure-security)
2. [Control Plane Policing (CoPP)](#2-control-plane-policing-copp)
3. [802.1X & Identity Services](#3-8021x--identity-services)
4. [MACsec](#4-macsec)
5. [TrustSec & SGT](#5-trustsec--sgt)

---

## 1. Infrastructure Security

### Device Hardening Checklist

```
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚                 Infrastructure Security                     â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚                                                             â”‚
â”‚  Management Plane:                                          â”‚
â”‚  â˜ SSH v2 only (disable Telnet)                           â”‚
â”‚  â˜ Strong passwords (Type 8 or 9)                         â”‚
â”‚  â˜ AAA (TACACS+ for admin)                                â”‚
â”‚  â˜ Role-based access control                              â”‚
â”‚  â˜ Timeout on VTY/Console                                 â”‚
â”‚  â˜ Logging and timestamps                                 â”‚
â”‚  â˜ NTP authentication                                     â”‚
â”‚  â˜ Encrypted configuration backups                        â”‚
â”‚                                                             â”‚
â”‚  Control Plane:                                             â”‚
â”‚  â˜ Control Plane Policing (CoPP)                          â”‚
â”‚  â˜ Routing protocol authentication                        â”‚
â”‚  â˜ BFD for fast failure detection                         â”‚
â”‚  â˜ uRPF (Unicast Reverse Path Forwarding)                â”‚
â”‚                                                             â”‚
â”‚  Data Plane:                                                â”‚
â”‚  â˜ ACLs at network boundaries                             â”‚
â”‚  â˜ DHCP snooping                                          â”‚
â”‚  â˜ Dynamic ARP Inspection                                 â”‚
â”‚  â˜ IP Source Guard                                        â”‚
â”‚  â˜ Storm control                                          â”‚
â”‚  â˜ Private VLANs                                          â”‚
â”‚                                                             â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
```

### uRPF (Unicast Reverse Path Forwarding)

```
uRPF prevents IP spoofing by verifying source address

Strict Mode:
â€¢ Source IP must be reachable via receiving interface
â€¢ Best for single-homed networks

Loose Mode:
â€¢ Source IP must exist in routing table (any interface)
â€¢ Works with asymmetric routing
```

```cisco
! Strict mode (single path)
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip verify unicast source reachable-via rx

! Loose mode (multi-path/asymmetric)
Router(config-if)# ip verify unicast source reachable-via any

! Allow specific sources (ACL)
Router(config)# ip verify unicast source reachable-via rx allow-default 100
```

### Routing Protocol Authentication

```cisco
! OSPF MD5 Authentication
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip ospf authentication message-digest
Router(config-if)# ip ospf message-digest-key 1 md5 SecretKey

! OSPF SHA Authentication (IOS-XE)
Router(config)# key chain OSPF-KEYS
Router(config-keychain)# key 1
Router(config-keychain-key)# key-string SecretKey
Router(config-keychain-key)# cryptographic-algorithm hmac-sha-256
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip ospf authentication key-chain OSPF-KEYS

! EIGRP Authentication
Router(config)# key chain EIGRP-KEYS
Router(config-keychain)# key 1
Router(config-keychain-key)# key-string SecretKey
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip authentication mode eigrp 100 md5
Router(config-if)# ip authentication key-chain eigrp 100 EIGRP-KEYS

! BGP Authentication
Router(config)# router bgp 65001
Router(config-router)# neighbor 10.1.1.2 password SecretKey
```

---

## 2. Control Plane Policing (CoPP)

### CoPP Overview

```
CoPP protects the router's CPU from attack traffic

Without CoPP:                    With CoPP:
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”     â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚         CPU             â”‚     â”‚         CPU             â”‚
â”‚   (overwhelmed)         â”‚     â”‚    (protected)          â”‚
â”‚   â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆ     â”‚     â”‚    â–“â–“â–“â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘         â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜     â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
        â†‘                               â†‘
   All traffic                    Rate-limited
   to CPU                         by CoPP
```

### CoPP Configuration

```cisco
! Step 1: Classify traffic to control plane
class-map match-all ICMP-CLASS
 match access-group name ICMP-ACL
class-map match-all BGP-CLASS
 match access-group name BGP-ACL
class-map match-all OSPF-CLASS
 match access-group name OSPF-ACL
class-map match-all SSH-CLASS
 match access-group name SSH-ACL

! ACLs for classification
ip access-list extended ICMP-ACL
 permit icmp any any
ip access-list extended BGP-ACL
 permit tcp any eq bgp any
 permit tcp any any eq bgp
ip access-list extended OSPF-ACL
 permit ospf any any
ip access-list extended SSH-ACL
 permit tcp any any eq 22

! Step 2: Define policy
policy-map COPP-POLICY
 class ICMP-CLASS
  police rate 64000 bps burst 8000 bytes
   conform-action transmit
   exceed-action drop
 class BGP-CLASS
  police rate 256000 bps
   conform-action transmit
   exceed-action drop
 class OSPF-CLASS
  police rate 128000 bps
   conform-action transmit
   exceed-action drop
 class SSH-CLASS
  police rate 64000 bps
   conform-action transmit
   exceed-action drop
 class class-default
  police rate 32000 bps
   conform-action transmit
   exceed-action drop

! Step 3: Apply to control plane
control-plane
 service-policy input COPP-POLICY

! Verification
Router# show policy-map control-plane
```

---

## 3. 802.1X & Identity Services

### 802.1X Architecture

```
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚                    802.1X Components                        â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚                                                             â”‚
â”‚   Supplicant          Authenticator        Auth Server     â”‚
â”‚   (Client)            (Switch/WLC)         (ISE/RADIUS)    â”‚
â”‚                                                             â”‚
â”‚   â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”          â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”          â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”       â”‚
â”‚   â”‚  PC    â”‚â”€â”€EAPOLâ”€â”€â–¶â”‚ Switch â”‚â”€â”€RADIUSâ”€â–¶â”‚  ISE   â”‚       â”‚
â”‚   â”‚(802.1X â”‚          â”‚        â”‚          â”‚        â”‚       â”‚
â”‚   â”‚ client)â”‚â—€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”‚        â”‚â—€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”‚        â”‚       â”‚
â”‚   â””â”€â”€â”€â”€â”€â”€â”€â”€â”˜          â””â”€â”€â”€â”€â”€â”€â”€â”€â”˜          â””â”€â”€â”€â”€â”€â”€â”€â”€â”˜       â”‚
â”‚                                                             â”‚
â”‚   Flow:                                                     â”‚
â”‚   1. Client connects (port unauthorized)                   â”‚
â”‚   2. Switch sends EAP-Request/Identity                     â”‚
â”‚   3. Client responds with identity                         â”‚
â”‚   4. Switch forwards to RADIUS                             â”‚
â”‚   5. RADIUS challenges client                              â”‚
â”‚   6. Client provides credentials                           â”‚
â”‚   7. RADIUS validates, returns Access-Accept               â”‚
â”‚   8. Switch authorizes port, applies policy                â”‚
â”‚                                                             â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
```

### 802.1X Switch Configuration

```cisco
! Enable AAA
Switch(config)# aaa new-model
Switch(config)# aaa authentication dot1x default group radius
Switch(config)# aaa authorization network default group radius
Switch(config)# aaa accounting dot1x default start-stop group radius

! Configure RADIUS server
Switch(config)# radius server ISE-PRIMARY
Switch(config-radius-server)# address ipv4 10.1.1.100 auth-port 1812 acct-port 1813
Switch(config-radius-server)# key RadiusSecret123

! Enable 802.1X globally
Switch(config)# dot1x system-auth-control

! Configure interface
Switch(config)# interface GigabitEthernet0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# authentication port-control auto
Switch(config-if)# authentication host-mode multi-auth
Switch(config-if)# dot1x pae authenticator
Switch(config-if)# mab                              ! MAB fallback
Switch(config-if)# authentication order dot1x mab
Switch(config-if)# authentication priority dot1x mab

! Verification
Switch# show dot1x all
Switch# show authentication sessions
Switch# show authentication sessions interface gi0/1
```

### MAB (MAC Authentication Bypass)

```
MAB for devices without 802.1X supplicant:
â€¢ Printers, IP phones, IoT devices
â€¢ Uses MAC address as username/password
â€¢ Fallback when 802.1X fails

Authentication Order:
1. dot1x (try 802.1X first)
2. mab (fallback to MAB)
3. webauth (optional web portal)
```

---

## 4. MACsec

### MACsec Overview

```
MACsec (802.1AE) - Layer 2 encryption

â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚                                                             â”‚
â”‚   Without MACsec:                                           â”‚
â”‚   â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”        Plaintext         â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”           â”‚
â”‚   â”‚Switch Aâ”‚â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”â”‚Switch Bâ”‚           â”‚
â”‚   â””â”€â”€â”€â”€â”€â”€â”€â”€â”˜  (sniffable, tamper)     â””â”€â”€â”€â”€â”€â”€â”€â”€â”˜           â”‚
â”‚                                                             â”‚
â”‚   With MACsec:                                              â”‚
â”‚   â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”       Encrypted          â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”           â”‚
â”‚   â”‚Switch Aâ”‚â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â”‚Switch Bâ”‚           â”‚
â”‚   â””â”€â”€â”€â”€â”€â”€â”€â”€â”˜  (AES-GCM-128/256)       â””â”€â”€â”€â”€â”€â”€â”€â”€â”˜           â”‚
â”‚                                                             â”‚
â”‚   Benefits:                                                 â”‚
â”‚   â€¢ Confidentiality (encryption)                           â”‚
â”‚   â€¢ Integrity (ICV - Integrity Check Value)               â”‚
â”‚   â€¢ Anti-replay protection                                 â”‚
â”‚   â€¢ Line-rate encryption (hardware)                        â”‚
â”‚                                                             â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
```

### MACsec Configuration (Switch-to-Switch)

```cisco
! Define key chain
Switch(config)# key chain MACSEC-KEYS macsec
Switch(config-keychain)# key 1
Switch(config-keychain-key)# cryptographic-algorithm aes-256-cmac
Switch(config-keychain-key)# key-string SecretKey123

! Define MKA policy
Switch(config)# mka policy MKA-POLICY
Switch(config-mka-policy)# macsec-cipher-suite gcm-aes-256

! Apply to interface
Switch(config)# interface GigabitEthernet0/1
Switch(config-if)# mka policy MKA-POLICY
Switch(config-if)# mka pre-shared-key key-chain MACSEC-KEYS
Switch(config-if)# macsec

! Verification
Switch# show mka sessions
Switch# show mka statistics
Switch# show macsec interface gi0/1
```

---

## 5. TrustSec & SGT

### TrustSec Overview

```
TrustSec: Policy based on identity, not IP address

Traditional ACL:                 TrustSec SGT:
permit ip 10.1.1.0 any          permit SGT-Employees to SGT-Servers
(What if user moves?)           (Identity follows user)

â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚                    TrustSec Components                      â”‚
â”œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¤
â”‚                                                             â”‚
â”‚  SGT (Scalable Group Tag):                                 â”‚
â”‚  â€¢ 16-bit tag assigned to traffic                         â”‚
â”‚  â€¢ Identifies security group (role)                        â”‚
â”‚  â€¢ Travels with packet through network                     â”‚
â”‚                                                             â”‚
â”‚  Classification:                                            â”‚
â”‚  â€¢ Static (interface/VLAN)                                 â”‚
â”‚  â€¢ Dynamic (802.1X/ISE)                                    â”‚
â”‚                                                             â”‚
â”‚  Enforcement:                                               â”‚
â”‚  â€¢ SGACL (SGT-based ACL)                                   â”‚
â”‚  â€¢ Applied at egress                                       â”‚
â”‚                                                             â”‚
â”‚  Example:                                                   â”‚
â”‚  â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”    â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”    â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”             â”‚
â”‚  â”‚ Employee â”‚â”€â”€â”€â–¶â”‚  Switch  â”‚â”€â”€â”€â–¶â”‚  Server  â”‚             â”‚
â”‚  â”‚ SGT=10   â”‚    â”‚ (SGT     â”‚    â”‚ SGT=20   â”‚             â”‚
â”‚  â”‚          â”‚    â”‚  enforced)â”‚    â”‚          â”‚             â”‚
â”‚  â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜    â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜    â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜             â”‚
â”‚                                                             â”‚
â”‚  SGACL: permit-10-to-20 (allow Employee to Server)        â”‚
â”‚                                                             â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
```

### TrustSec Configuration

```cisco
! Enable CTS (Cisco TrustSec)
Switch(config)# cts authorization list CTS-LIST
Switch(config)# aaa authorization network CTS-LIST group radius

! Static SGT assignment (manual)
Switch(config)# interface GigabitEthernet0/1
Switch(config-if)# cts manual
Switch(config-if-cts-manual)# policy static sgt 10

! VLAN-to-SGT mapping
Switch(config)# cts role-based sgt-map vlan-list 100 sgt 10

! IP-to-SGT mapping (static)
Switch(config)# cts role-based sgt-map 10.1.1.0/24 sgt 10

! SGACL definition
Switch(config)# cts role-based permissions from 10 to 20 PERMIT-ALL
Switch(config)# ip access-list role-based PERMIT-ALL
Switch(config-rb-acl)# permit ip

! Enable enforcement
Switch(config)# cts role-based enforcement

! Verification
Switch# show cts interface
Switch# show cts role-based permissions
Switch# show cts role-based counters
```

---

## ğŸ“ Module 5 Exercises

### Exercise 5.1: CoPP
Create a CoPP policy that:
- Allows 256kbps for BGP
- Allows 128kbps for OSPF
- Limits ICMP to 64kbps
- Drops excess default traffic

### Exercise 5.2: 802.1X
Configure a switch port with:
- 802.1X authentication
- MAB fallback
- Guest VLAN for failures

### Exercise 5.3: MACsec
Configure MACsec between two switches:
- AES-256 encryption
- Pre-shared key

---

*Previous: [â† Network Assurance](../04-network-assurance/README.md) | Next: [Automation â†’](../06-automation/README.md)*

